from jobVisualization.models import *

monthList = ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月']
weekList = ["星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日"]
educations = {'博士':1, '硕士':2, '本科':3, '大专':4, '高中':5, '中专/中技':6, '初中及以下':7, '学历不限':8}
educationList = ['博士', '硕士', '本科', '大专', '高中', '中专/中技', '初中及以下', '学历不限']
workExperience = ['在校/应届生', '经验不限', '1-3年', '3-5年', '5-10年', '10年以上']
salaryList = ['0-10k', '10-20k', '20-30k', '30-40k', '40k以上']
companyPeople = ['20人以下', '100人以下', '500人以下', '1000人以下', '1万人以下', '1万人以上']


def getAllJobs():
    return JobInfo.objects.all()